Siehe auch: [df.iloc()](df.iloc.ipynb)

# df.loc()

### Verwenden von .loc

- `.loc[]` wird verwendet, um Daten anhand der Label (Zeilen- oder Spaltennamen) abzurufen.
- Syntax: `DataFrame.loc[Zeilenname, Spaltenname]`

### Beispiel: Verwende .loc, um Daten basierend auf dem Label abzurufen

In [3]:
import numpy as np
import pandas as pd

# Erstelle einen DataFrame
data = {'Name': ['Anna', 'Ben', 'Chris'],
        'Alter': [23, 30, 35], 
        'Stadt': ['Berlin', 'Hamburg', 'München']
       }

df = pd.DataFrame(data)
df

# Verwende .loc, um den Namen und das Alter von Anna zu erhalten
df.loc[0, ['Name', 'Alter']]

Name     Anna
Alter      23
Name: 0, dtype: object

## Daten lokalisieren und manipulieren

Mit `.iloc` und `.loc` kannst du Daten präzise lokalisieren, abrufen und manipulieren.

### Beispiel: Ändere den Wert einer bestimmten Zelle

In [4]:
# Ändere das Alter von Ben auf 31
df.loc[1, 'Alter'] = 31
df

    Name  Alter    Stadt
0   Anna     23   Berlin
1    Ben     31  Hamburg
2  Chris     35  München

In [5]:
# Ändere das Stadt von Chris auf Nürnberg
df.loc[2, 'Stadt'] = 'Nürnberg'
df

    Name  Alter     Stadt
0   Anna     23    Berlin
1    Ben     31   Hamburg
2  Chris     35  Nürnberg